import sys
input = sys.stdin.readline
def add_star(ptn):
    return "* " + ptn + " *" # 줄 앞뒤로 ' *'아 붙는다.

def star(n):
    if n == 1:
        return ["*"]
    else:       # 새로 추가되는 두 줄
        return ["*"*(4*n-3), "*"+" "*(4*n-5)+"*"]\
                + list(map(add_star, star(n-1)))\
                + ["*"+" "*(4*n-5)+"*", "*"*(4*n-3)]
n= int(input()) 
print("\n".join(star(n)))
# n == 4
# add_star에서 print(ptn)
# *
#  
# *****
# *   *
# * * *
# *   *
# *****
#
# 위의 그림에 앞뒤로 '* ',' *'가 붙고 위아래 새롭게 줄이 추가된다.
#
# *********
# *       *
# * ***** *
# * *   * *
# * * * * *
# * *   * *
# * ***** *
# *       *
# *********

# *************
# *           *
# * ********* *
# * *       * *
# * * ***** * *
# * * *   * * *
# * * * * * * *
# * * *   * * *
# * * ***** * *
# * *       * *
# * ********* *
# *           *
# *************